handouts/truthtable.org
#+title: Interpreting logical expressions
#+author: Patrick D. Elliott
#+LATEX_HEADER_EXTRA: \input{slides-boilerplate}
#+EXPORT_FILE_NAME: ../docs/semantics
#+BEAMER_THEME: metropolis
#+BEAMER_COLOR_THEME: owl [snowy]
#+BEAMER_HEADER: \input{beamerplate.tex}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+BEAMER_FONT_THEME: professionalfonts
#+LATEX_COMPILER: xelatex
#+OPTIONS: toc:nil H:2

* Propositional logic: semantics
 
** Semantics of propositional logic

- Expressions of propositional logic are interpreted relative to an /assignment function/ (let's call it \(g\)).
  * This is a total function from the propositional variables in the language to truth-values.
    
\[g_1 := \left[\begin{aligned}[c]
p \to \mathbf{True}\\
q \to \mathbf{True}\\
r \to \mathbf{False}\\
\ldots
\end{aligned}\right]\]

** Semantics of propositional logic cont.

- Specifying a semantics for propositional logic involves recursively defining a /denotation function/ \(\eval[g]{.}\), which maps expressions to truth-values.
  * If \(p\) is atomic, then \(\eval*[g]{p} = g(p)\).
  * \(\eval*[g]{\neg \phi } = \mathbf{True} \text{ iff }  \eval*[g]{\phi } = \mathbf{False}\).
  * \(\eval*[g]{\phi \wedge \psi} = \mathbf{True} \text{ iff }   \eval*[g]{\phi } = \mathbf{True} \mathbin{\&} \eval*[g]{\psi} = \mathbf{True}\)
  * \(\eval*[g]{\phi \vee \psi} = \mathbf{True} \text{ iff }   \eval*[g]{\phi } = \mathbf{True} \mathbin{\text{or} }  \eval*[g]{\psi} = \mathbf{True}\)
    
** An example

- \(\eval*[g]{\neg (p \wedge q) \vee r} = \mathbf{True}\text{ iff }\ldots\)
  * \(\eval*[g]{\neg (p \wedge q)} = \mathbf{True}\mathbin{\text{or} }\eval*[g]{r} = \mathbf{True} \)
  * \(\eval*[g]{(p \wedge q)} = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True} \)
  * \(\eval*[g]{p} = \mathbf{False} \mathbin{\text{or} } \eval*[g]{q} = \mathbf{False}\mathbin{\text{ or }}g(r) = \mathbf{True}\)
  * \(g(p) = \mathbf{False}\mathbin{\text{ or } }g(q) = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True} \)
    
- The denotation specifies the conditions a variable assignment \(g\) must meet in order for the sentence to be judged /true/ relative to it.
- This information can be encoded as a truth-table.
- Given a fixed expression \(\phi \), you can model \(\eval*{\phi }\) as a function from assignments to truth-values; a truth-table gives a condensed extension of this function.
  
** Truth-table

- \(\eval*[g]{\neg (p \wedge q) \vee r}= \mathbf{True} \text{ iff } g(p) = \mathbf{False}\mathbin{\text{ or } }g(q) = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True}\) 
  
| \(p\) | \(q\) | \(r\) | \(\neg (p \wedge q) \vee r\) |
|-------+-------+-------+-------------------|
|     1 |     1 |     1 |                 1 |
|     1 |     1 |     0 |                 0 |
|     1 |     0 |     1 |                 1 |
|     0 |     1 |     1 |                 1 |
|     0 |     0 |     1 |                 1 |
|     0 |     1 |     0 |                 1 |
|     1 |     0 |     0 |                 1 |
|     0 |     0 |     0 |                 1 |

* Truth-table: implementation in Haskell

** The task

- As an informal assignment, I asked you to try to implement a program that maps expressions of ~PropL~ (our recursive datatype for expressions of propositional logic) to a /truth-table/.
- In order to implement truth-tables in Haskell, we first need to decide on a couple of datatypes:
  * The type for a /variable assignment/.
  * The type for a /truth-table/.
    
** Variable assignments in Haskell

- A straightforward option for a variable assignment is a /list of tuples/, where variables are paired with Truth-Values.
- Following our implementation of ~PropL~, we'll assume that variables are just strings.
- We can declare a /type synonym/ using the ~type~ keyword to declare a convenient abbreviation for this complex type:
  
#+begin_src haskell
  type VarAssignment = [(String,Bool)]
#+end_src

#+begin_src haskell
  ghci> [("p",True),("q",False),("r",True)]
#+end_src

** Looking up values

- We need a way of "looking up" what value an assignment gives to a variable.
- In order to do this, we'll define a function ~lookup~ of type ~VarAssignment -> String -> Bool~.
  
#+begin_src haskell
lookup :: VarAssignment -> String -> Bool
lookup [] _ = undefined
lookup ((key,val):ps) x = if key == x then val else lookup ps x
#+end_src

- ~lookup~ recurses through the list until it finds a tuple whose first element (the "key") matches the argument ~x~; it returns the second element of that tuple (the "value").

** Bonus: Generalizing lookup

- *Exercise:* what's the most general (i.e., maximally polymorphic) type that the definition of ~lookup~ is compatible with?
  
