docs/semantics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-22 Mon 17:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interpreting logical expressions</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Interpreting logical expressions</h1>

<div id="outline-container-org89cef28" class="outline-2">
<h2 id="org89cef28"><span class="section-number-2">1.</span> Propositional logic: semantics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9ec1740" class="outline-3">
<h3 id="org9ec1740"><span class="section-number-3">1.1.</span> Semantics of propositional logic</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Expressions of propositional logic are interpreted relative to an <i>assignment function</i> (let's call it \(g\)).
<ul class="org-ul">
<li>This is a total function from the propositional variables in the language to truth-values.</li>
</ul></li>
</ul>

<p>
\[g_1 := \left[\begin{aligned}[c]
p \to \mathbf{True}\\
q \to \mathbf{True}\\
r \to \mathbf{False}\\
\ldots
\end{aligned}\right]\]
</p>
</div>
</div>

<div id="outline-container-org8bba80d" class="outline-3">
<h3 id="org8bba80d"><span class="section-number-3">1.2.</span> Semantics of propositional logic cont.</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Specifying a semantics for propositional logic involves recursively defining a <i>denotation function</i> \(\eval[g]{.}\), which maps expressions to truth-values.
<ul class="org-ul">
<li>If \(p\) is atomic, then \(\eval*[g]{p} = g(p)\).</li>
<li>\(\eval*[g]{\neg \phi } = \mathbf{True} \text{ iff }  \eval*[g]{\phi } = \mathbf{False}\).</li>
<li>\(\eval*[g]{\phi \wedge \psi} = \mathbf{True} \text{ iff }   \eval*[g]{\phi } = \mathbf{True} \mathbin{\&} \eval*[g]{\psi} = \mathbf{True}\)</li>
<li>\(\eval*[g]{\phi \vee \psi} = \mathbf{True} \text{ iff }   \eval*[g]{\phi } = \mathbf{True} \mathbin{\text{or} }  \eval*[g]{\psi} = \mathbf{True}\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2aefb21" class="outline-3">
<h3 id="org2aefb21"><span class="section-number-3">1.3.</span> An example</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>\(\eval*[g]{\neg (p \wedge q) \vee r} = \mathbf{True}\text{ iff }\ldots\)
<ul class="org-ul">
<li>\(\eval*[g]{\neg (p \wedge q)} = \mathbf{True}\mathbin{\text{or} }\eval*[g]{r} = \mathbf{True} \)</li>
<li>\(\eval*[g]{(p \wedge q)} = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True} \)</li>
<li>\(\eval*[g]{p} = \mathbf{False} \mathbin{\text{or} } \eval*[g]{q} = \mathbf{False}\mathbin{\text{ or }}g(r) = \mathbf{True}\)</li>
<li>\(g(p) = \mathbf{False}\mathbin{\text{ or } }g(q) = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True} \)</li>
</ul></li>

<li>The denotation specifies the conditions a variable assignment \(g\) must meet in order for the sentence to be judged <i>true</i> relative to it.</li>
<li>This information can be encoded as a truth-table.</li>
<li>Given a fixed expression \(\phi \), you can model \(\eval*{\phi }\) as a function from assignments to truth-values; a truth-table gives a condensed extension of this function.</li>
</ul>
</div>
</div>

<div id="outline-container-orge4f2e2e" class="outline-3">
<h3 id="orge4f2e2e"><span class="section-number-3">1.4.</span> Truth-table</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>\(\eval*[g]{\neg (p \wedge q) \vee r}= \mathbf{True} \text{ iff } g(p) = \mathbf{False}\mathbin{\text{ or } }g(q) = \mathbf{False}\mathbin{\text{or} }g(r) = \mathbf{True}\)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">\(p\)</th>
<th scope="col" class="org-right">\(q\)</th>
<th scope="col" class="org-right">\(r\)</th>
<th scope="col" class="org-right">\(\neg (p \wedge q) \vee r\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org8c2a756" class="outline-2">
<h2 id="org8c2a756"><span class="section-number-2">2.</span> Truth-table: implementation in Haskell</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd13a4eb" class="outline-3">
<h3 id="orgd13a4eb"><span class="section-number-3">2.1.</span> The task</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>As an informal assignment, I asked you to try to implement a program that maps expressions of <code>PropL</code> (our recursive datatype for expressions of propositional logic) to a <i>truth-table</i>.</li>
<li>In order to implement truth-tables in Haskell, we first need to decide on a couple of datatypes:
<ul class="org-ul">
<li>The type for a <i>variable assignment</i>.</li>
<li>The type for a <i>truth-table</i>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd1a81cc" class="outline-3">
<h3 id="orgd1a81cc"><span class="section-number-3">2.2.</span> Variable assignments in Haskell</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>A straightforward option for a variable assignment is a <i>list of tuples</i>, where variables are paired with Truth-Values.</li>
<li>Following our implementation of <code>PropL</code>, we'll assume that variables are just strings.</li>
<li>We can declare a <i>type synonym</i> using the <code>type</code> keyword to declare a convenient abbreviation for this complex type:</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">type</span> <span style="color: #b4befe;">VarAssignment</span> <span style="color: #89dceb;">=</span> [(<span style="color: #b4befe;">String</span>,<span style="color: #b4befe;">Bool</span>)]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> [(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">False</span>),(<span style="color: #a6e3a1;">"r"</span>,<span style="color: #cba6f7;">True</span>)]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca7498b" class="outline-3">
<h3 id="orgca7498b"><span class="section-number-3">2.3.</span> Looking up values</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>We need a way of "looking up" what value an assignment gives to a variable.</li>
<li>In order to do this, we'll define a function <code>lookup</code> of type <code>VarAssignment -&gt; String -&gt; Bool</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">lookup</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">VarAssignment</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">String</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">lookup</span> <span style="color: #cba6f7;">[]</span> <span style="color: #cba6f7;">_</span> <span style="color: #89dceb;">=</span> undefined
<span style="color: #89b4fa;">lookup</span> ((key,val)<span style="color: #cba6f7;">:</span>ps) x <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">if</span> key <span style="color: #89dceb;">==</span> x <span style="color: #cba6f7;">then</span> val <span style="color: #cba6f7;">else</span> lookup ps x
</pre>
</div>

<ul class="org-ul">
<li><code>lookup</code> recurses through the list until it finds a tuple whose first element (the "key") matches the argument <code>x</code>; it returns the second element of that tuple (the "value").</li>
</ul>
</div>
</div>

<div id="outline-container-orga52b4e0" class="outline-3">
<h3 id="orga52b4e0"><span class="section-number-3">2.4.</span> Bonus: Generalizing lookup</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>Exercise:</b> what's the most general (i.e., maximally polymorphic) type that the definition of <code>lookup</code> is compatible with?</li>
</ul>
</div>
</div>
