handouts/truthtable.org
** Aside: improving lookup

- Our definition of ~lookup~ will do for the purposes of this exercise, but it has some clear deficiencies:
  * Variables can be paired with multiple values (bad); ~lookup~ ignore all but the first paired value in the list.
  * ~lookup~ is *unsafe* (i.e., it's a partial function). Specifically, if the provided key isn't part of the variable assignment.
- The solution is to swap out the list of tuples with a data structure tailored for key value pairs - ~Map~ from the ~Data.Map~ module, which comes with a built-in /safe/ lookup function.
  * We'll learn more about how to make functions like ~Map~ safe when we learn about the ~Maybe~ constructor, later in the semester.

** Denotation

- Now that we have some concept of an assignment, we can recursively define a denotation function ~interpretAtA~, which takes a variable assignment, an expression of ~PropL~ and returns a boolean.
  * this is the core implementation of the semantics of propositional logic. 
  * As a reminder, here's the ~PropL~ datatype.
    
#+begin_src haskell 
data PropL = PVar String | PNot PropL | PropL `PAnd` PropL | PropL `POr` PropL deriving Eq
#+end_src

** Base of the recursion

#+begin_src haskell
  interpretAtA :: VarAssignment -> PropL -> Bool
  interpretAtA v (PVar p) = lookup v p
#+end_src

- Note that since ~lookup~ is unsafe, ~interpretAtA~ is also unsafe.
- This means we need to be careful to provide ~interpretAtA~ with an assignment which provides a value for every variable in the expression (in fact, we'll automate this).
  
** Completing the recursion  

- We can use Haskell's built-in boolean operators to provide a complete denotational semantics for ~Propl~.
- Note that the semantics here completely parallels the recursive definition of the denotation function. 

#+begin_src haskell
    interpretAtA :: VarAssignment -> PropL -> Bool
    interpretAtA a (PVar p) = lookup a p
    interpretAtA a (PNot p) = not (interpretAtA a p)
    interpretAtA a (p `PAnd` q) = interpretAtA a p && interpretAtA a q
    interpretAtA a (p `POr` q) = interpretAtA a p || interpretAtA a q
#+end_src

** An aside: case expressions

When we have a function definition which does different things depending on the form of the argument it receives (via pattern matching), we can often make the definition more terse by using a /case expression/.

#+begin_src haskell
  interpretAtA a exp = case exp of
    (PVar p) -> lookup a p
    (PNot p) -> not (interpretAtA a p)
    (p `PAnd` q) -> interpretAtA a p && interpretAtA a q
    (p `POr` q) -> interpretAtA a p || interpretAtA a q
#+end_src

** Example

#+begin_src haskell
  ghci> _g1 = [("p",True),("q",False),("r",True)]
  ghci> _form1 = PNot (PVar "p" `PAnd` PVar "q") `POr` PVar "r"
  ghci> interpretAtA _g1 _form1
  True
#+end_src

** Interim summary

- We've defined ~interpretA~ which maps an assignment and a formula to a truth-value (our denotation function).
- Our next task will be to define a function that generates all "relevant" assignments, given a formula. We'll call this ~mkAssignments~.
- First we need a list of all the variables which occur in a formula - we'll make use of our existing ~gatherNames~ function.
  
** Reminder: ~gatherNames~.

Here, we import a built-in function from the ~Data.List~ module for removing duplicate entries, rather than implementing it ourselves.

#+begin_src haskell
  import Data.List (nub)

  gatherNames' :: PropL -> [String]                  
  gatherNames' (PVar s) = [s]                        
  gatherNames' (PNot p) = gatherNames p                
  gatherNames' (PAnd p q) = gatherNames p ++ gatherNames q
  gatherNames' (POr p q) = gatherNames p ++ gatherNames q

  gatherNames = nub . gatherNames'
#+end_src

** Example

Given a formula ~gatherNames~ will give you a list of variables in that formula.

#+begin_src haskell
  ghci> gatherNames (PNot (PVar "p" `PAnd` PVar "q") `POr` PVar "r")
  ["p","q","r"]
#+end_src

