docs/semantics.html

<div id="outline-container-orgc562b69" class="outline-3">
<h3 id="orgc562b69"><span class="section-number-3">2.5.</span> Aside: improving lookup</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Our definition of <code>lookup</code> will do for the purposes of this exercise, but it has some clear deficiencies:
<ul class="org-ul">
<li>Variables can be paired with multiple values (bad); <code>lookup</code> ignore all but the first paired value in the list.</li>
<li><code>lookup</code> is <b>unsafe</b> (i.e., it's a partial function). Specifically, if the provided key isn't part of the variable assignment.</li>
</ul></li>
<li>The solution is to swap out the list of tuples with a data structure tailored for key value pairs - <code>Map</code> from the <code>Data.Map</code> module, which comes with a built-in <i>safe</i> lookup function.
<ul class="org-ul">
<li>We'll learn more about how to make functions like <code>Map</code> safe when we learn about the <code>Maybe</code> constructor, later in the semester.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd049ac1" class="outline-3">
<h3 id="orgd049ac1"><span class="section-number-3">2.6.</span> Denotation</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Now that we have some concept of an assignment, we can recursively define a denotation function <code>interpretAtA</code>, which takes a variable assignment, an expression of <code>PropL</code> and returns a boolean.
<ul class="org-ul">
<li>this is the core implementation of the semantics of propositional logic.</li>
<li>As a reminder, here's the <code>PropL</code> datatype.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #cba6f7;">String</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PNot</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PropL</span> <span style="color: #cba6f7;">deriving</span> <span style="color: #cba6f7;">Eq</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org68aa841" class="outline-3">
<h3 id="org68aa841"><span class="section-number-3">2.7.</span> Base of the recursion</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">interpretAtA</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">VarAssignment</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">interpretAtA</span> v (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">=</span> lookup v p
</pre>
</div>

<ul class="org-ul">
<li>Note that since <code>lookup</code> is unsafe, <code>interpretAtA</code> is also unsafe.</li>
<li>This means we need to be careful to provide <code>interpretAtA</code> with an assignment which provides a value for every variable in the expression (in fact, we'll automate this).</li>
</ul>
</div>
</div>

<div id="outline-container-org0310d73" class="outline-3">
<h3 id="org0310d73"><span class="section-number-3">2.8.</span> Completing the recursion</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>We can use Haskell's built-in boolean operators to provide a complete denotational semantics for <code>Propl</code>.</li>
<li>Note that the semantics here completely parallels the recursive definition of the denotation function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">interpretAtA</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">VarAssignment</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">interpretAtA</span> a (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">=</span> lookup a p
<span style="color: #89b4fa;">interpretAtA</span> a (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> not (interpretAtA a p)
<span style="color: #89b4fa;">interpretAtA</span> a (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">=</span> interpretAtA a p <span style="color: #89dceb;">&amp;&amp;</span> interpretAtA a q
<span style="color: #89b4fa;">interpretAtA</span> a (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">=</span> interpretAtA a p <span style="color: #89dceb;">||</span> interpretAtA a q
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b5fb57" class="outline-3">
<h3 id="org0b5fb57"><span class="section-number-3">2.9.</span> An aside: case expressions</h3>
<div class="outline-text-3" id="text-2-9">
<p>
When we have a function definition which does different things depending on the form of the argument it receives (via pattern matching), we can often make the definition more terse by using a <i>case expression</i>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">interpretAtA</span> a exp <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">case</span> exp <span style="color: #cba6f7;">of</span>
  (<span style="color: #cba6f7;">PVar</span> p) <span style="color: #89dceb;">-&gt;</span> lookup a p
  (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">-&gt;</span> not (interpretAtA a p)
  (p <span style="color: #89dceb;">`PAnd`</span> q) <span style="color: #89dceb;">-&gt;</span> interpretAtA a p <span style="color: #89dceb;">&amp;&amp;</span> interpretAtA a q
  (p <span style="color: #89dceb;">`POr`</span> q) <span style="color: #89dceb;">-&gt;</span> interpretAtA a p <span style="color: #89dceb;">||</span> interpretAtA a q
</pre>
</div>
</div>
</div>

<div id="outline-container-org35eabc5" class="outline-3">
<h3 id="org35eabc5"><span class="section-number-3">2.10.</span> Example</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> _g1 <span style="color: #89dceb;">=</span> [(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">False</span>),(<span style="color: #a6e3a1;">"r"</span>,<span style="color: #cba6f7;">True</span>)]
ghci<span style="color: #89b4fa;">&gt;</span> _form1 <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p"</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"q"</span>) <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"r"</span>
ghci<span style="color: #89b4fa;">&gt;</span> interpretAtA _g1 _form1
<span style="color: #cba6f7;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2476f67" class="outline-3">
<h3 id="org2476f67"><span class="section-number-3">2.11.</span> Interim summary</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>We've defined <code>interpretA</code> which maps an assignment and a formula to a truth-value (our denotation function).</li>
<li>Our next task will be to define a function that generates all "relevant" assignments, given a formula. We'll call this <code>mkAssignments</code>.</li>
<li>First we need a list of all the variables which occur in a formula - we'll make use of our existing <code>gatherNames</code> function.</li>
</ul>
</div>
</div>

<div id="outline-container-org4dca36a" class="outline-3">
<h3 id="org4dca36a"><span class="section-number-3">2.12.</span> Reminder: <code>gatherNames</code>.</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Here, we import a built-in function from the <code>Data.List</code> module for removing duplicate entries, rather than implementing it ourselves.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">import</span> <span style="color: #cba6f7;">Data.List</span> (nub)

<span style="color: #89b4fa;">gatherNames'</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">-&gt;</span> [<span style="color: #b4befe;">String</span>]                  
<span style="color: #89b4fa;">gatherNames'</span> (<span style="color: #cba6f7;">PVar</span> s) <span style="color: #89dceb;">=</span> [s]                        
<span style="color: #89b4fa;">gatherNames'</span> (<span style="color: #cba6f7;">PNot</span> p) <span style="color: #89dceb;">=</span> gatherNames p                
<span style="color: #89b4fa;">gatherNames'</span> (<span style="color: #cba6f7;">PAnd</span> p q) <span style="color: #89dceb;">=</span> gatherNames p <span style="color: #89dceb;">++</span> gatherNames q
<span style="color: #89b4fa;">gatherNames'</span> (<span style="color: #cba6f7;">POr</span> p q) <span style="color: #89dceb;">=</span> gatherNames p <span style="color: #89dceb;">++</span> gatherNames q

<span style="color: #89b4fa;">gatherNames</span> <span style="color: #89dceb;">=</span> nub <span style="color: #89dceb;">.</span> gatherNames'
</pre>
</div>
</div>
</div>

<div id="outline-container-org5218ffa" class="outline-3">
<h3 id="org5218ffa"><span class="section-number-3">2.13.</span> Example</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Given a formula <code>gatherNames</code> will give you a list of variables in that formula.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> gatherNames (<span style="color: #cba6f7;">PNot</span> (<span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"p"</span> <span style="color: #89dceb;">`PAnd`</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"q"</span>) <span style="color: #89dceb;">`POr`</span> <span style="color: #cba6f7;">PVar</span> <span style="color: #a6e3a1;">"r"</span>)
[<span style="color: #a6e3a1;">"p"</span>,<span style="color: #a6e3a1;">"q"</span>,<span style="color: #a6e3a1;">"r"</span>]
</pre>
</div>
</div>
</div>
