handouts/truthtable.org
** Generating assignments

- Now that we have a list of variables, we need to generate all of the possible assignments of those variables to truth values, i.e., we need a function ~mkAssignments~ of the following type:

#+begin_src haskell
  mkAssignments :: [String] -> [VarAssignment]
#+end_src

- This is probably the hardest part of the task, and will involve some advanced list manipulation.
  
** ReplicateM

The secret sauce: ~replicateM~ from ~Control.Monad~

#+begin_src haskell
  ghci> import Control.Monad (replicateM)
  ghci> replicateM 3 "01"
  ["000","001","010","011","100","101","110","111"]
  ghci> replicateM 3 [True,False]
  [[True,True,True],[True,True,False],[True,False,True],
   [True,False,False],[False,True,True],[False,True,False],
   [False,False,True],[False,False,False]]
#+end_src

We use this to create all sequences of boolean values of length \(n\).

** Creating assignments

In order to make assignments, we /zip/ a list of variables with a list of boolean values:

#+begin_src haskell
  ghci> import Data.List (zip)

  ghci> zip ["p","q","r"] [True,True,True]
  [("p",True),("q",True),("r",True)]
#+end_src

We need to do this for every list of boolean values of length \(n\), where \(n\) is the number of variables we have.

** Putting it all together

#+begin_src haskell
  mkAssignments :: [String] -> [VarAssignment]
  mkAssignment vs = [zip vs ts | ts <- replicateM (length vs) [True,False]]
#+end_src

#+begin_src haskell
  ghci> mkAssignments ["p","q"]
  [[("p",True),("q",True)],
   [("p",True),("q",False)],
   [("p",False),("q",True)],
   [("p",False),("q",False)]]
#+end_src

** Assignments from a formula

To get all the "relevant" assignments for a formula \(p\), we first gather all the variables in \(p\), and then apply ~mkAssignments~ to the resulting list.

#+begin_src haskell
  pAssignments :: PropL -> [VarAssignment]
  pAssignments = mkAssignments . gatherNames 
#+end_src

N.b., it's crucial that the definition of ~gatherNames~ removes duplicates (~nub~) in order for this to work properly.

** Generating a truth-table

In order to generate a truth-table, we simply pair each assignment in the output of ~pAssignments~, with the denotation of the formula at that assignment:

#+begin_src haskell
  mkTruthTable :: PropL -> [(VarAssignment,Bool)]
  mkTruthTable p = [(a,interpretAtA a p) | a <- pAssignments p]
#+end_src

** Example output

#+begin_src haskell
  ghci> mkTruthTable (PNot (PVar "p" `PAnd` PVar "q") `POr` PVar "r")
  [([("p",True),("q",True),("r",True)],True),
   ([("p",True),("q",True),("r",False)],False),
   ([("p",True),("q",False),("r",True)],True),
   ([("p",True),("q",False),("r",False)],True),
   ([("p",False),("q",True),("r",True)],True),
   ([("p",False),("q",True),("r",False)],True),
   ([("p",False),("q",False),("r",True)],True),
   ([("p",False),("q",False),("r",False)],True)]
#+end_src

** 
   :PROPERTIES:
   :BEAMER_opt: label=findings,standout
   :END:
 
   \(\mathscr{Fin}\)


** References

#+print_bibliography:

# Local Variables:
# org-latex-src-block-backend: engraved
# End:
