docs/semantics.html

<div id="outline-container-org7cfa886" class="outline-3">
<h3 id="org7cfa886"><span class="section-number-3">2.14.</span> Generating assignments</h3>
<div class="outline-text-3" id="text-2-14">
<ul class="org-ul">
<li>Now that we have a list of variables, we need to generate all of the possible assignments of those variables to truth values, i.e., we need a function <code>mkAssignments</code> of the following type:</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">mkAssignments</span> <span style="color: #89dceb;">::</span> [<span style="color: #b4befe;">String</span>] <span style="color: #89dceb;">-&gt;</span> [<span style="color: #b4befe;">VarAssignment</span>]
</pre>
</div>

<ul class="org-ul">
<li>This is probably the hardest part of the task, and will involve some advanced list manipulation.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe9c69c" class="outline-3">
<h3 id="orgfe9c69c"><span class="section-number-3">2.15.</span> ReplicateM</h3>
<div class="outline-text-3" id="text-2-15">
<p>
The secret sauce: <code>replicateM</code> from <code>Control.Monad</code>
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">import</span> <span style="color: #cba6f7;">Control.Monad</span> (replicateM)
ghci<span style="color: #89b4fa;">&gt;</span> replicateM 3 <span style="color: #a6e3a1;">"01"</span>
[<span style="color: #a6e3a1;">"000"</span>,<span style="color: #a6e3a1;">"001"</span>,<span style="color: #a6e3a1;">"010"</span>,<span style="color: #a6e3a1;">"011"</span>,<span style="color: #a6e3a1;">"100"</span>,<span style="color: #a6e3a1;">"101"</span>,<span style="color: #a6e3a1;">"110"</span>,<span style="color: #a6e3a1;">"111"</span>]
ghci<span style="color: #89b4fa;">&gt;</span> replicateM 3 [<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>]
[[<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>],[<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>],[<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">True</span>],
 [<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">False</span>],[<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>],[<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>],
 [<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">True</span>],[<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">False</span>,<span style="color: #cba6f7;">False</span>]]
</pre>
</div>

<p>
We use this to create all sequences of boolean values of length \(n\).
</p>
</div>
</div>

<div id="outline-container-org98fa31c" class="outline-3">
<h3 id="org98fa31c"><span class="section-number-3">2.16.</span> Creating assignments</h3>
<div class="outline-text-3" id="text-2-16">
<p>
In order to make assignments, we <i>zip</i> a list of variables with a list of boolean values:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> <span style="color: #cba6f7;">import</span> <span style="color: #cba6f7;">Data.List</span> (zip)

ghci<span style="color: #89b4fa;">&gt;</span> zip [<span style="color: #a6e3a1;">"p"</span>,<span style="color: #a6e3a1;">"q"</span>,<span style="color: #a6e3a1;">"r"</span>] [<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">True</span>]
[(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"r"</span>,<span style="color: #cba6f7;">True</span>)]
</pre>
</div>

<p>
We need to do this for every list of boolean values of length \(n\), where \(n\) is the number of variables we have.
</p>
</div>
</div>

<div id="outline-container-orgc333c6c" class="outline-3">
<h3 id="orgc333c6c"><span class="section-number-3">2.17.</span> Putting it all together</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">mkAssignments</span> <span style="color: #89dceb;">::</span> [<span style="color: #b4befe;">String</span>] <span style="color: #89dceb;">-&gt;</span> [<span style="color: #b4befe;">VarAssignment</span>]
<span style="color: #89b4fa;">mkAssignment</span> vs <span style="color: #89dceb;">=</span> [zip vs ts <span style="color: #89dceb;">|</span> ts <span style="color: #89dceb;">&lt;-</span> replicateM (length vs) [<span style="color: #cba6f7;">True</span>,<span style="color: #cba6f7;">False</span>]]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #89b4fa;">&gt;</span> mkAssignments [<span style="color: #a6e3a1;">"p"</span>,<span style="color: #a6e3a1;">"q"</span>]
[[(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">True</span>)],
 [(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">True</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">False</span>)],
 [(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">False</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">True</span>)],
 [(<span style="color: #a6e3a1;">"p"</span>,<span style="color: #cba6f7;">False</span>),(<span style="color: #a6e3a1;">"q"</span>,<span style="color: #cba6f7;">False</span>)]]
</pre>
</div>
</div>
</div>

<div id="outline-container-org309dff3" class="outline-3">
<h3 id="org309dff3"><span class="section-number-3">2.18.</span> Assignments from a formula</h3>
<div class="outline-text-3" id="text-2-18">
<p>
To get all the "relevant" assignments for a formula \(p\), we first gather all the variables in \(p\), and then apply <code>mkAssignments</code> to the resulting list.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">pAssignments</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">-&gt;</span> [<span style="color: #b4befe;">VarAssignment</span>]
<span style="color: #89b4fa;">pAssignments</span> <span style="color: #89dceb;">=</span> mkAssignments <span style="color: #89dceb;">.</span> gatherNames 
</pre>
</div>

<p>
N.b., it's crucial that the definition of <code>gatherNames</code> removes duplicates (<code>nub</code>) in order for this to work properly.
</p>
</div>
</div>

<div id="outline-container-org3ad0975" class="outline-3">
<h3 id="org3ad0975"><span class="section-number-3">2.19.</span> Generating a truth-table</h3>
<div class="outline-text-3" id="text-2-19">
<p>
In order to generate a truth-table, we simply pair each assignment in the output of <code>pAssignments</code>, with the denotation of the formula at that assignment:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #89b4fa;">mkTruthTable</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">PropL</span> <span style="color: #89dceb;">-&gt;</span> [(<span style="color: #b4befe;">VarAssignment</span>,<span style="color: #b4befe;">Bool</span>)]
<span style="color: #89b4fa;">mkTruthTable</span> p <span style="color: #89dceb;">=</span> [(a,interpretAtA a p) <span style="color: #89dceb;">|</span> a <span style="color: #89dceb;">&lt;-</span> pAssignments p]
</pre>
</div>
</div>
</div>

<div id="outline-container-org14ced57" class="outline-3">
<h3 id="org14ced57"><span class="section-number-3">2.20.</span> <span class="todo TODO">TODO</span> Some additional useful tools</h3>
<div class="outline-text-3" id="text-2-20">
</div>
<ol class="org-ol">
<li><a id="orgbf00470"></a><span class="todo TODO">TODO</span> hoogle<br /></li>
</ol>
</div>

<div id="outline-container-org9216dd1" class="outline-3">
<h3 id="org9216dd1"><span class="section-number-3">2.21.</span> </h3>
<div class="outline-text-3" id="text-2-21">
<p>
\(\mathscr{Fin}\)
</p>
</div>
</div>


<div id="outline-container-org816735c" class="outline-3">
<h3 id="org816735c"><span class="section-number-3">2.22.</span> References</h3>
<div class="outline-text-3" id="text-2-22">

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patrick D. Elliott</p>
<p class="date">Created: 2023-05-22 Mon 17:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>